IDEA StatiCa Open Model
ISDType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of IDEA StatiCa Detail
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ISDType
Public Enumeration ISDType
public enum class ISDType
Members
Member name | Value | Description
Wall | 0 |  Wall
Member1D | 1 |  Member1D
FrameJoint | 2 |  Frame joint
Diaphragm | 3 |  Diaphragm
See Also
Reference
IdeaRS.OpenModel.Detail Namespace